{
  "name": "Jim Reid",
  "title": "Senior Software Engineer",
  "github": "https://github.com/reidj32/resume",
  "linkedin": "https://www.linkedin.com/in/james-reid-42666450/",
  "about": {
    "title": "About",
    "paragraphs": [
      "Software is hard... I think? Maybe it's the users not knowing what they really want? Maybe it's that software \"people\" just don't make sense to the rest of the world? Maybe it's that everything around us always seems to be changing. Well, building great software is a process, and we can only hope to achieve such lofty aspirations! Obviously it has been done before, we just have to work together, and find the method that works for us.",
      "Building software can be so much fun. Websites, calculation engines, mobile phone apps, and so on... You name it; I have probably experimented with it. If not, I'm not trying hard enough to learn new and exciting things! But software is such a small part of the fun we can have. Taking a fishing trip is a great way to spend the weekend. Perhaps renovating that room that has been on your personal to-do list for ages? What about a Guitar Hero contest with your friends? Finding some time (and space) to work on your truck (or car) to add the latest accessory you had overnighted because you couldn't wait to have it? The point is; we should try to have fun building what's next."
    ]
  },
  "skills": {
    "title": "Skills",
    "sections": [
      {
        "title": "Attributes",
        "values": [
          "Fast learner",
          "Organized",
          "Good communicator",
          "Adaptable",
          "Creative",
          "Resourceful",
          "Critical",
          "Mentoring",
          "Confident",
          "Cooperative",
          "Patient",
          "Team player",
          "Dedicated"
        ]
      },
      {
        "title": "Languages",
        "values": [
          "C#",
          "Java",
          "VB.NET",
          "SQL",
          "Javascript",
          "CSS",
          "HTML",
          "C",
          "C++",
          "JSON",
          "XML",
          "PowerShell",
          "SQL Server Integration Services (SSIS)",
          "SQL Server Reporting Services (SSRS)"
        ]
      },
      {
        "title": "Libraries & Frameworks",
        "values": [
          "ASP.NET MVC",
          "ASP.NET Web API",
          "Entity Framework",
          "Autofac",
          "AutoMapper",
          "LINQ",
          "OWIN",
          "jQuery",
          "AJAX",
          "Bootstrap 3",
          "REST",
          "SOAP",
          "Boost C++",
          "Standard Template Library (STL)"
        ]
      },
      {
        "title": "Applications & Tools",
        "values": [
          "ReSharper Ultimate",
          "Redgate SQL Toolbelt",
          "Git",
          "Team Foundation Server (TFS)",
          "Microsoft SQL Server",
          "SQL Server Management Studio (SSMS)",
          "Visual Studio Code",
          "Visual Studio Professional",
          "Eclipse IDE",
          "VirtualBox",
          "VMware Workstation",
          "Microsoft Office Suite",
          "IIS Web Server",
          "Windows Server 2008 R2",
          "Windows Server 2012 R2",
          "Jira",
          "Confluence",
          "Team City"
        ]
      }
    ]
  },
  "experience": {
    "title": "Experience",
    "history": [
      {
        "company": "Guaranty Bank",
        "description":
          "Founded in 1913 and recently acquired by First Citizens Bank, we strive to provide banking assistance and services to the under banked communities in five states across the country.",
        "contact": {
          "address": {
            "street": "501 W. North Shore Drive",
            "city": "Glendale",
            "state": "WI",
            "zip": "53217"
          },
          "phone": "(800) 235-4636",
          "website": {
            "link": "https://www.guarantybank.com/",
            "title": "www.guarantybank.com"
          }
        },
        "positions": [
          {
            "title": "Senior Software Engineer",
            "duration": "(July 2015 - Present)",
            "accomplishments": [
              {
                "statement":
                  "Designed and implemented numerous features and enhancements to our flagship retail product offering, Credit Builder.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Architected a brand new, fully integrated and automated engine for Credit Builder Online, a strategic, mission-critical product designed to significantly grow the business and enter new markets by providing online access to new prospects to our highly profitable retail product, Credit Builder.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Developed and integrated a robust, user-friendly rules engine for our primary products. This allowed business users to control and configure, business, technical, legal, regulatory, and compliance requirements directly without the new to start a new project with development team.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Architected a brand new, full-stack custom solution to extract and bundle sensitive customer information from vendor systems with the intent of selling debt to 3rd party buyers driving roughly $200,000 in revenue annually. Designed to be extremely durable, highly configurable, and scalable based on business needs. Because of the system's re-usability, it was used to organize, bundle, and ship millions of customer records, saving approximately $300,000 in costs during an operational conversion.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Architected a brand new, full-stack custom solution to electronically gather customer signatures for required documents utilizing DocuSign. This scalable system initially saved 1-2 full time employees, with the potential to save 8-10. Provided a user editable rules engine and a set of checks and balances to prevent fraud saving the company thousands of dollars each month.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Expanded and maintained the company's main data warehouse. Processed daily, monthly, and yearly aggregating mission-critical data utilized by over a dozen internal systems and departments.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Integrated with TransUnion to provide the bank with customer FICO scores in an on demand fashion. Secured all customer data using modern encryption techniques, keeping the bank in compliance with all customer data storage regulations.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Researched build automation systems and helped move the bank towards the use of the selected system, Team Foundation Server. Reduced the communication break down between engineers and system administrators by streamlining the deployment process while maintaining a separation of duties.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Defined project architecture templates for use when building robust, full-stack custom solutions for the bank.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Supported mission-critical systems 24/7 when on call ensuring high availability for our customers and business users.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Gathered requirements directly from business users, positioning the development team for a successful project without the need to redo large portions because of a communication breakdown between departments.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              }
            ]
          }
        ]
      },
      {
        "company": "Advicent Solutions",
        "description":
          "Driving innovation and financial technology to advisors and their customers helping them meet their long term goals with confidence.",
        "contact": {
          "address": {
            "street": "10700 Research Dr #1",
            "city": "Milwaukee",
            "state": "WI",
            "zip": "53226"
          },
          "phone": "(855) 885-7526",
          "website": {
            "link": "https://www.advicentsolutions.com/",
            "title": "www.advicentsolutions.com"
          }
        },
        "positions": [
          {
            "title": "Software Developer",
            "duration": "(January 2013 - July 2015)",
            "accomplishments": [
              {
                "statement":
                  "Maintained an enterprise ready web application built on top of a variety of modern tools and languages, including C#, C++, C, Java, JavaScript, HTML5, CSS3, and SQL.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Designed and implemented new features for enterprise ready applications, including our flagship product NaviPlan. Introduced internal tools used to increase to efficiency of other teams, driving increased revenue with the time reclaimed.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Architected a brand new data warehouse system using MongoDB to store extremely large datasets for use in historical calculations when predicting a customer's financial outcome.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Modernized online financial calculators driving an increase in the number of prospects that became recurring clients for our customers. As a result, we were able to sell more features to those customers each year thus increasing our annual revenue.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Delegated project work to small teams of developers following agile methodologies to build new features and correct any production defects that had been discovered.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Handled escalated issues directly from customers on an as needed basis.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Worked directly with members of several teams to build better software faster, with fewer defects, and to the specification expected by the customer. Team members included business analysts, quality assurance analysts, project managers, product directors, and members of upper management.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Contributed to end user help documentation, and to internal process documentation.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Participated in code reviews with peers ensuring a strong code base, and good knowledge transfer among all team members.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Prepared new team members for the projects they would be responsible for and ensured they would contribute effectively to a highly efficient team.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Trained members from other departments to use development tools effectively. This resulted in better defect reports and better requirements definitions for new feature requests.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Collaborated directly with customers, fostering good communication with our development team, and providing a transparent view of the progress being made on a feature request or defect fix. With an active line of communication always open to the end users, software quality met and exceeded the expectations of our customers.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              }
            ]
          }
        ]
      },
      {
        "company": "University of Wisconsin-Platteville",
        "description":
          "Preparing students for their next career in a world filled with a changing technological landscape.",
        "contact": {
          "address": {
            "street": "1 University Plaza",
            "city": "Platteville",
            "state": "WI",
            "zip": "53818"
          },
          "phone": "(608) 342-1491",
          "website": {
            "link": "https://www.uwplatt.edu/",
            "title": "www.uwplatt.edu"
          }
        },
        "positions": [
          {
            "title": "Peer Assisted Learner",
            "duration": "(September 2012 - December 2012)",
            "accomplishments": [
              {
                "statement":
                  "Attended introductory courses for programming languages such as C, C++, Java, and Visual Basic (VB.NET).",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Provided a more approachable avenue for students to seek out help with their coursework.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Uncovered students who were struggling to complete assignments and labs and provided assistance directly, or with the help of the class lecturer.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Posted office hours dedicated to providing students with any help required to complete labs and assignments. Office hours also offered students to opportunity to learn from their mistakes by reviewing incorrect questions on exams.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Taught students how to use modern integrated development environments (IDEs) such as Visual Studio, NetBeans or Eclipse.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              }
            ]
          },
          {
            "title": "Grader & Lab Assistant",
            "duration": "(February 2010 - May 2012)",
            "accomplishments": [
              {
                "statement":
                  "Reviewed exams and assignments created by the computer science and software engineering departments.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Evaluated questions and concerns of students that were raised after an exam or assignment.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Guided students through labs and assignments when additional help was needed.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              },
              {
                "statement":
                  "Introduced students to new tools and methodologies not discussed during lectures, but were a desired subject to learn about.",
                "story": {
                  "situation": "",
                  "obstacle": "",
                  "action": "",
                  "result": ""
                }
              }
            ]
          }
        ]
      }
    ]
  },
  "education": {
    "title": "Education",
    "undergraduate": {
      "title": "Undergraduate",
      "programs": [
        {
          "title": "University of Wisconsin-Platteville",
          "contact": {
            "address": {
              "street": "1 University Plaza",
              "city": "Platteville",
              "state": "WI",
              "zip": "53818"
            },
            "phone": "(608) 342-1491",
            "website": {
              "link": "https://www.uwplatt.edu/",
              "title": "www.uwplatt.edu"
            }
          },
          "degree": { "title": "Degree", "value": "Bachelor of Science" },
          "major": { "title": "Major", "value": "Software Engineering" },
          "class": { "title": "Graduation", "value": "Class of 2012" }
        }
      ]
    },
    "pluralsight": {
      "title": "Pluralsight",
      "courses": [
        {
          "title": "Building Your First API with ASP.NET Core",
          "author": "Kevin Dockx",
          "link":
            "https://app.pluralsight.com/library/courses/asp-dotnet-core-api-building-first"
        },
        {
          "title": "Building a RESTful API with ASP.NET Core",
          "author": "Kevin Dockx",
          "link":
            "https://app.pluralsight.com/library/courses/asp-dot-net-core-restful-api-building"
        },
        {
          "title": "LINQ Fundamentals with C# 6.0",
          "author": "Scott Allen",
          "link":
            "https://app.pluralsight.com/library/courses/linq-fundamentals-csharp-6"
        },
        {
          "title": "TFS Build 2015: First Look",
          "author": "Esteban Garcia",
          "link":
            "https://app.pluralsight.com/library/courses/tfs-build-2015-first-look"
        },
        {
          "title": "Introduction to Bootstrap",
          "author": "Scott Allen",
          "link":
            "https://app.pluralsight.com/library/courses/bootstrap-introduction"
        },
        {
          "title": "Simplified .NET Background Tasks with Hangfire",
          "author": "Rag Dhiman",
          "link":
            "https://app.pluralsight.com/library/courses/simplified-dotnet-background-tasks-hangfire"
        },
        {
          "title": "Introduction to Git",
          "author": "Geoffrey Grosenbach",
          "link":
            "https://app.pluralsight.com/library/courses/introduction-to-git"
        },
        {
          "title": "How Git Works",
          "author": "Paolo Perrotta",
          "link": "https://app.pluralsight.com/library/courses/how-git-works"
        },
        {
          "title": "Reactive Programming in Java 8 With RxJava",
          "author": "Russell Elledge",
          "link":
            "https://app.pluralsight.com/library/courses/reactive-programming-java-8-rxjava"
        },
        {
          "title": "Angular Fundamentals",
          "author": "Joe Eames and Jim Cooper",
          "link":
            "https://app.pluralsight.com/library/courses/angular-fundamentals"
        },
        {
          "title": "Angular: Getting Started",
          "author": "Deborah Kurata",
          "link":
            "https://app.pluralsight.com/library/courses/angular-2-getting-started-update"
        },
        {
          "title": "Angular Routing",
          "author": "Deborah Kurata",
          "link": "https://app.pluralsight.com/library/courses/angular-routing"
        },
        {
          "title": "Angular Reactive Forms",
          "author": "Deborah Kurata",
          "link":
            "https://app.pluralsight.com/library/courses/angular-2-reactive-forms"
        },
        {
          "title": "Angular Forms",
          "author": "Mark Zamoyta",
          "link": "https://app.pluralsight.com/library/courses/angular-2-forms"
        },
        {
          "title": "Angular HTTP Communication",
          "author": "Brice Wilson",
          "link":
            "https://app.pluralsight.com/library/courses/angular-http-communication"
        },
        {
          "title": "Angular Material",
          "author": "Ajden Towfeek",
          "link": "https://app.pluralsight.com/library/courses/angular-material"
        },
        {
          "title": "Angular CLI",
          "author": "John Papa",
          "link": "https://app.pluralsight.com/library/courses/angular-cli"
        },
        {
          "title": "Understanding Android Application Basics",
          "author": "Jim Wilson",
          "link":
            "https://app.pluralsight.com/library/courses/android-application-basics-understanding"
        },
        {
          "title": "Working with Android Tools and Testing",
          "author": "Jim Wilson",
          "link":
            "https://app.pluralsight.com/library/courses/android-tools-testing"
        },
        {
          "title": "Enhancing the Android Application Experience",
          "author": "Jim Wilson",
          "link":
            "https://app.pluralsight.com/library/courses/android-enhancing-application-experience"
        },
        {
          "title": "Managing Android App Data with SQLite",
          "author": "Jim Wilson",
          "link":
            "https://app.pluralsight.com/library/courses/android-managing-app-data-sqlite"
        },
        {
          "title": "Getting Started With Ubuntu",
          "author": "Elton Stoneman",
          "link":
            "https://app.pluralsight.com/library/courses/ubuntu-getting-started"
        },
        {
          "title": "What's New in VMware vSphere 6",
          "author": "David Davis",
          "link":
            "https://app.pluralsight.com/library/courses/vmware-vsphere-6-whats-new"
        },
        {
          "title": "Getting Started with Laravel - The Basics",
          "author": "Max Schwarzmueller",
          "link":
            "https://app.pluralsight.com/library/courses/laravel-php-framework-getting-started-the-basics"
        }
      ]
    }
  }
}
